Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.3.35/atdf/ATSAMA5D28.atdf
          <instance name="QSPI1">
            <register-group address-space="base" name="QSPI1" name-in-module="QSPI" offset="0xF0024000"/>
            <parameters>
              <param name="INSTANCE_ID" value="53"/>
              <param name="CLOCK_ID" value="53"/>
              <param name="DMAC_ID_TX" value="48"/>
              <param name="DMAC_ID_RX" value="49"/>
            </parameters>
            <signals>
              <signal pad="PA11" function="B" group="QSPI1_CS"/>
              <signal pad="PB6" function="D" group="QSPI1_CS"/>
              <signal pad="PB15" function="E" group="QSPI1_CS"/>
              <signal pad="PA7" function="B" group="QSPI1_IO" index="0"/>
              <signal pad="PB7" function="D" group="QSPI1_IO" index="0"/>
              <signal pad="PB16" function="E" group="QSPI1_IO" index="0"/>
              <signal pad="PA8" function="B" group="QSPI1_IO" index="1"/>
              <signal pad="PB8" function="D" group="QSPI1_IO" index="1"/>
              <signal pad="PB17" function="E" group="QSPI1_IO" index="1"/>
              <signal pad="PA9" function="B" group="QSPI1_IO" index="2"/>
              <signal pad="PB9" function="D" group="QSPI1_IO" index="2"/>
              <signal pad="PB18" function="E" group="QSPI1_IO" index="2"/>
              <signal pad="PA10" function="B" group="QSPI1_IO" index="3"/>
              <signal pad="PB10" function="D" group="QSPI1_IO" index="3"/>
              <signal pad="PB19" function="E" group="QSPI1_IO" index="3"/>
              <signal pad="PA6" function="B" group="QSPI1_SCK"/>
              <signal pad="PB5" function="D" group="QSPI1_SCK"/>
              <signal pad="PB14" function="E" group="QSPI1_SCK"/>
            </signals>
          </instance>
        </module>
        <module name="RSTC" id="11265" version="C">
          <instance name="RSTC">
            <register-group address-space="base" name="RSTC" name-in-module="RSTC" offset="0xF8048000"/>
          </instance>
        </module>
        <module name="RTC" id="6056" version="ZE">
          <instance name="RTC">
            <register-group address-space="base" name="RTC" name-in-module="RTC" offset="0xF80480B0"/>
          </instance>
        </module>
        <module name="RXLP" id="11285" version="D">
          <instance name="RXLP">
            <register-group address-space="base" name="RXLP" name-in-module="RXLP" offset="0xF8049000"/>
            <parameters>
              <param name="INSTANCE_ID" value="76"/>
            </parameters>
          </instance>
        </module>
        <module name="SCKC" id="11073" version="G">
          <instance name="SCKC">
            <register-group address-space="base" name="SCKC" name-in-module="SCKC" offset="0xF8048050"/>
          </instance>
        </module>
        <module name="SDMMC" id="44002" version="H">
          <instance name="SDMMC0">
            <register-group address-space="base" name="SDMMC0" name-in-module="SDMMC" offset="0xA0000000"/>
            <parameters>
              <param name="INSTANCE_ID" value="31"/>
              <param name="CLOCK_ID" value="31"/>
            </parameters>
            <signals>
              <signal pad="PA13" function="A" group="SDMMC0_CD"/>
              <signal pad="PA0" function="A" group="SDMMC0_CK"/>
              <signal pad="PA1" function="A" group="SDMMC0_CMD"/>
              <signal pad="PA2" function="A" group="SDMMC0_DAT" index="0"/>
              <signal pad="PA3" function="A" group="SDMMC0_DAT" index="1"/>
              <signal pad="PA4" function="A" group="SDMMC0_DAT" index="2"/>
              <signal pad="PA5" function="A" group="SDMMC0_DAT" index="3"/>
              <signal pad="PA6" function="A" group="SDMMC0_DAT" index="4"/>
              <signal pad="PA7" function="A" group="SDMMC0_DAT" index="5"/>
              <signal pad="PA8" function="A" group="SDMMC0_DAT" index="6"/>
              <signal pad="PA9" function="A" group="SDMMC0_DAT" index="7"/>
              <signal pad="PA10" function="A" group="SDMMC0_RSTN"/>
              <signal pad="PA12" function="A" group="SDMMC0_WP"/>
              <signal pad="PA11" function="A" group="SDMMC0_1V8SEL"/>
            </signals>
          </instance>
          <instance name="SDMMC1">
            <register-group address-space="base" name="SDMMC1" name-in-module="SDMMC" offset="0xB0000000"/>
            <parameters>
              <param name="INSTANCE_ID" value="32"/>
              <param name="CLOCK_ID" value="32"/>
            </parameters>
            <signals>
              <signal pad="PA30" function="E" group="SDMMC1_CD"/>
              <signal pad="PA22" function="E" group="SDMMC1_CK"/>
              <signal pad="PA28" function="E" group="SDMMC1_CMD"/>
              <signal pad="PA18" function="E" group="SDMMC1_DAT" index="0"/>
              <signal pad="PA19" function="E" group="SDMMC1_DAT" index="1"/>
              <signal pad="PA20" function="E" group="SDMMC1_DAT" index="2"/>
              <signal pad="PA21" function="E" group="SDMMC1_DAT" index="3"/>
              <signal pad="PA27" function="E" group="SDMMC1_RSTN"/>
              <signal pad="PA29" function="E" group="SDMMC1_WP"/>
            </signals>
          </instance>
        </module>
        <module name="SECUMOD" id="44107" version="B">
          <instance name="SECUMOD">
            <register-group address-space="base" name="SECUMOD" name-in-module="SECUMOD" offset="0xFC040000"/>
            <parameters>
              <param name="INSTANCE_ID" value="16"/>
              <param name="CLOCK_ID" value="16"/>
            </parameters>
          </instance>
        </module>
        <module name="SFC" id="11170" version="I">
          <instance name="SFC">
            <register-group address-space="base" name="SFC" name-in-module="SFC" offset="0xF804C000"/>
            <parameters>
              <param name="INSTANCE_ID" value="50"/>
              <param name="CLOCK_ID" value="50"/>
            </parameters>
          </instance>
        </module>
        <module name="SFR" id="11066" version="S">
          <instance name="SFR">
            <register-group address-space="base" name="SFR" name-in-module="SFR" offset="0xF8030000"/>
            <parameters>
              <param name="INSTANCE_ID" value="60"/>
            </parameters>
          </instance>
        </module>
