Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.3.35/atdf/ATSAMA5D28.atdf
        <register caption="Interrupt Mask Register" name="AESB_IMR" offset="0x18" rw="R" size="4">
          <bitfield caption="Data Ready Interrupt Mask" mask="0x00000001" name="DATRDY"/>
          <bitfield caption="Unspecified Register Access Detection Interrupt Mask" mask="0x00000100" name="URAD"/>
        </register>
        <register caption="Interrupt Status Register" name="AESB_ISR" offset="0x1C" rw="R" size="4">
          <bitfield caption="Data Ready" mask="0x00000001" name="DATRDY"/>
          <bitfield caption="Unspecified Register Access Detection Status" mask="0x00000100" name="URAD"/>
          <bitfield caption="Unspecified Register Access" mask="0x0000F000" name="URAT" values="AESB_ISR__URAT"/>
        </register>
        <register caption="Key Word Register" count="4" name="AESB_KEYWR" offset="0x20" rw="W" size="4">
          <bitfield caption="Key Word" mask="0xFFFFFFFF" name="KEYW"/>
        </register>
        <register caption="Input Data Register" count="4" name="AESB_IDATAR" offset="0x40" rw="W" size="4">
          <bitfield caption="Input Data Word" mask="0xFFFFFFFF" name="IDATA"/>
        </register>
        <register caption="Output Data Register" count="4" name="AESB_ODATAR" offset="0x50" rw="R" size="4">
          <bitfield caption="Output Data" mask="0xFFFFFFFF" name="ODATA"/>
        </register>
        <register caption="Initialization Vector Register" count="4" name="AESB_IVR" offset="0x60" rw="W" size="4">
          <bitfield caption="Initialization Vector" mask="0xFFFFFFFF" name="IV"/>
        </register>
      </register-group>
      <value-group caption="Dual Input Buffer" name="AESB_MR__DUALBUFF">
        <value caption="AESB_IDATARx cannot be written during processing of previous block." name="INACTIVE" value="0x0"/>
        <value caption="AESB_IDATARx can be written during processing of previous block when SMOD = 0x2. It speeds up the overall runtime of large files." name="ACTIVE" value="0x1"/>
      </value-group>
      <value-group caption="Start Mode" name="AESB_MR__SMOD">
        <value caption="Manual mode" name="MANUAL_START" value="0x0"/>
        <value caption="Auto mode" name="AUTO_START" value="0x1"/>
        <value caption="AESB_IDATAR0 access only Auto mode" name="IDATAR0_START" value="0x2"/>
      </value-group>
      <value-group caption="Operating Mode" name="AESB_MR__OPMOD">
        <value caption="Electronic Code Book mode" name="ECB" value="0x0"/>
        <value caption="Cipher Block Chaining mode" name="CBC" value="0x1"/>
        <value caption="Counter mode (16-bit internal counter)" name="CTR" value="0x4"/>
      </value-group>
      <value-group caption="Key" name="AESB_MR__CKEY">
        <value caption="This field must be written with 0xE the first time that AESB_MR is programmed. For subsequent programming of the AESB_MR register, any value can be written, including that of 0xE.Always reads as 0." name="PASSWD" value="0xE"/>
      </value-group>
      <value-group caption="Unspecified Register Access" name="AESB_ISR__URAT">
        <value caption="Input Data Register written during the data processing when SMOD = 0x2 mode" name="IDR_WR_PROCESSING" value="0x0"/>
        <value caption="Output Data Register read during the data processing" name="ODR_RD_PROCESSING" value="0x1"/>
        <value caption="Mode Register written during the data processing" name="MR_WR_PROCESSING" value="0x2"/>
        <value caption="Output Data Register read during the sub-keys generation" name="ODR_RD_SUBKGEN" value="0x3"/>
        <value caption="Mode Register written during the sub-keys generation" name="MR_WR_SUBKGEN" value="0x4"/>
        <value caption="Write-only register read access" name="WOR_RD_ACCESS" value="0x5"/>
      </value-group>
    </module>
    <module caption="Advanced Interrupt Controller" id="11051" name="AIC" version="K">
      <register-group name="AIC">
        <register caption="Source Select Register" name="AIC_SSR" offset="0x00" rw="RW" size="4">
          <bitfield caption="Interrupt Line Selection" mask="0x0000007F" name="INTSEL"/>
        </register>
        <register caption="Source Mode Register" name="AIC_SMR" offset="0x04" rw="RW" size="4">
          <bitfield caption="Priority Level" mask="0x00000007" name="PRIORITY" values="AIC_SMR__PRIORITY"/>
          <bitfield caption="Interrupt Source Type" mask="0x00000060" name="SRCTYPE" values="AIC_SMR__SRCTYPE"/>
        </register>
        <register caption="Source Vector Register" name="AIC_SVR" offset="0x08" rw="RW" size="4">
          <bitfield caption="Source Vector" mask="0xFFFFFFFF" name="VECTOR"/>
        </register>
        <register caption="Interrupt Vector Register" name="AIC_IVR" offset="0x10" rw="R" size="4">
          <bitfield caption="Interrupt Vector Register" mask="0xFFFFFFFF" name="IRQV"/>
        </register>
        <register caption="FIQ Vector Register" name="AIC_FVR" offset="0x14" rw="R" size="4">
          <bitfield caption="FIQ Vector Register" mask="0xFFFFFFFF" name="FIQV"/>
        </register>
        <register caption="Interrupt Status Register" name="AIC_ISR" offset="0x18" rw="R" size="4">
          <bitfield caption="Current Interrupt Identifier" mask="0x0000007F" name="IRQID"/>
        </register>
        <register caption="Interrupt Pending Register 0" name="AIC_IPR0" offset="0x20" rw="R" size="4">
          <bitfield caption="Interrupt Pending" mask="0x00000001" name="FIQ"/>
          <bitfield caption="Interrupt Pending" mask="0x00000002" name="PID1"/>
          <bitfield caption="Interrupt Pending" mask="0x00000004" name="PID2"/>
          <bitfield caption="Interrupt Pending" mask="0x00000008" name="PID3"/>
          <bitfield caption="Interrupt Pending" mask="0x00000010" name="PID4"/>
          <bitfield caption="Interrupt Pending" mask="0x00000020" name="PID5"/>
          <bitfield caption="Interrupt Pending" mask="0x00000040" name="PID6"/>
          <bitfield caption="Interrupt Pending" mask="0x00000080" name="PID7"/>
          <bitfield caption="Interrupt Pending" mask="0x00000100" name="PID8"/>
          <bitfield caption="Interrupt Pending" mask="0x00000200" name="PID9"/>
          <bitfield caption="Interrupt Pending" mask="0x00000400" name="PID10"/>
          <bitfield caption="Interrupt Pending" mask="0x00000800" name="PID11"/>
          <bitfield caption="Interrupt Pending" mask="0x00001000" name="PID12"/>
          <bitfield caption="Interrupt Pending" mask="0x00002000" name="PID13"/>
          <bitfield caption="Interrupt Pending" mask="0x00004000" name="PID14"/>
          <bitfield caption="Interrupt Pending" mask="0x00008000" name="PID15"/>
          <bitfield caption="Interrupt Pending" mask="0x00010000" name="PID16"/>
          <bitfield caption="Interrupt Pending" mask="0x00020000" name="PID17"/>
          <bitfield caption="Interrupt Pending" mask="0x00040000" name="PID18"/>
          <bitfield caption="Interrupt Pending" mask="0x00080000" name="PID19"/>
          <bitfield caption="Interrupt Pending" mask="0x00100000" name="PID20"/>
          <bitfield caption="Interrupt Pending" mask="0x00200000" name="PID21"/>
          <bitfield caption="Interrupt Pending" mask="0x00400000" name="PID22"/>
          <bitfield caption="Interrupt Pending" mask="0x00800000" name="PID23"/>
          <bitfield caption="Interrupt Pending" mask="0x01000000" name="PID24"/>
          <bitfield caption="Interrupt Pending" mask="0x02000000" name="PID25"/>
          <bitfield caption="Interrupt Pending" mask="0x04000000" name="PID26"/>
          <bitfield caption="Interrupt Pending" mask="0x08000000" name="PID27"/>
          <bitfield caption="Interrupt Pending" mask="0x10000000" name="PID28"/>
          <bitfield caption="Interrupt Pending" mask="0x20000000" name="PID29"/>
          <bitfield caption="Interrupt Pending" mask="0x40000000" name="PID30"/>
          <bitfield caption="Interrupt Pending" mask="0x80000000" name="PID31"/>
        </register>
