Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.3.35/atdf/ATSAMA5D28.atdf
        <register caption="Control Disable Register" name="ISC_CTRLDIS" offset="0x04" rw="W" size="4">
          <bitfield caption="Capture Disable" mask="0x00000001" name="DISABLE"/>
          <bitfield caption="Software Reset" mask="0x00000100" name="SWRST"/>
        </register>
        <register caption="Control Status Register" name="ISC_CTRLSR" offset="0x08" rw="R" size="4">
          <bitfield caption="Capture pending" mask="0x00000001" name="CAPTURE"/>
          <bitfield caption="Profile Update Pending" mask="0x00000002" name="UPPRO"/>
          <bitfield caption="Histogram Request Pending" mask="0x00000004" name="HISREQ"/>
          <bitfield caption="Field Status (only relevant when the video stream is interlaced)" mask="0x00000010" name="FIELD"/>
          <bitfield caption="Synchronization In Progress" mask="0x80000000" name="SIP"/>
        </register>
        <register caption="Parallel Front End Configuration 0 Register" name="ISC_PFE_CFG0" offset="0x0C" rw="RW" size="4">
          <bitfield caption="Horizontal Synchronization Polarity" mask="0x00000001" name="HPOL"/>
          <bitfield caption="Vertical Synchronization Polarity" mask="0x00000002" name="VPOL"/>
          <bitfield caption="Pixel Clock Polarity" mask="0x00000004" name="PPOL"/>
          <bitfield caption="Field Polarity" mask="0x00000008" name="FPOL"/>
          <bitfield caption="Parallel Front End Mode" mask="0x00000070" name="MODE" values="ISC_PFE_CFG0__MODE"/>
          <bitfield caption="Continuous Acquisition" mask="0x00000080" name="CONT"/>
          <bitfield caption="Gated input clock" mask="0x00000100" name="GATED"/>
          <bitfield caption="CCIR656 input mode" mask="0x00000200" name="CCIR656"/>
          <bitfield caption="CCIR656 CRC Decoder" mask="0x00000400" name="CCIR_CRC"/>
          <bitfield caption="CCIR 10 bits or 8 bits" mask="0x00000800" name="CCIR10_8N"/>
          <bitfield caption="Column Cropping Enable" mask="0x00001000" name="COLEN"/>
          <bitfield caption="Row Cropping Enable" mask="0x00002000" name="ROWEN"/>
          <bitfield caption="Frame Skipping Counter" mask="0x00FF0000" name="SKIPCNT"/>
          <bitfield caption="CCIR Replication" mask="0x08000000" name="CCIR_REP"/>
          <bitfield caption="Bits Per Sample" mask="0x70000000" name="BPS" values="ISC_PFE_CFG0__BPS"/>
          <bitfield caption="Up Multiply with Replication" mask="0x80000000" name="REP"/>
        </register>
        <register caption="Parallel Front End Configuration 1 Register" name="ISC_PFE_CFG1" offset="0x10" rw="RW" size="4">
          <bitfield caption="Column Minimum Limit" mask="0x0000FFFF" name="COLMIN"/>
          <bitfield caption="Column Maximum Limit" mask="0xFFFF0000" name="COLMAX"/>
        </register>
        <register caption="Parallel Front End Configuration 2 Register" name="ISC_PFE_CFG2" offset="0x14" rw="RW" size="4">
          <bitfield caption="Row Minimum Limit" mask="0x0000FFFF" name="ROWMIN"/>
          <bitfield caption="Row Maximum Limit" mask="0xFFFF0000" name="ROWMAX"/>
        </register>
        <register caption="Clock Enable Register" name="ISC_CLKEN" offset="0x18" rw="W" size="4">
          <bitfield caption="ISP Clock Enable" mask="0x00000001" name="ICEN"/>
          <bitfield caption="Master Clock Enable" mask="0x00000002" name="MCEN"/>
        </register>
        <register caption="Clock Disable Register" name="ISC_CLKDIS" offset="0x1C" rw="W" size="4">
          <bitfield caption="ISP Clock Disable" mask="0x00000001" name="ICDIS"/>
          <bitfield caption="Master Clock Disable" mask="0x00000002" name="MCDIS"/>
          <bitfield caption="ISP Clock Software Reset" mask="0x00000100" name="ICSWRST"/>
          <bitfield caption="Master Clock Software Reset" mask="0x00000200" name="MCSWRST"/>
        </register>
        <register caption="Clock Status Register" name="ISC_CLKSR" offset="0x20" rw="R" size="4">
          <bitfield caption="ISP Clock Status Register" mask="0x00000001" name="ICSR"/>
          <bitfield caption="Master Clock Status Register" mask="0x00000002" name="MCSR"/>
          <bitfield caption="Synchronization In Progress" mask="0x80000000" name="SIP"/>
        </register>
        <register caption="Clock Configuration Register" name="ISC_CLKCFG" offset="0x24" rw="RW" size="4">
          <bitfield caption="ISP Clock Divider" mask="0x000000FF" name="ICDIV"/>
          <bitfield caption="ISP Clock Selection" mask="0x00000100" name="ICSEL"/>
          <bitfield caption="Master Clock Divider" mask="0x00FF0000" name="MCDIV"/>
          <bitfield caption="Master Clock Reference Clock Selection" mask="0x03000000" name="MCSEL"/>
        </register>
        <register caption="Interrupt Enable Register" name="ISC_INTEN" offset="0x28" rw="W" size="4">
          <bitfield caption="Vertical Synchronization Detection Interrupt Enable" mask="0x00000001" name="VD"/>
          <bitfield caption="Horizontal Synchronization Detection Interrupt Enable" mask="0x00000002" name="HD"/>
          <bitfield caption="Software Reset Completed Interrupt Enable" mask="0x00000010" name="SWRST"/>
          <bitfield caption="Disable Completed Interrupt Enable" mask="0x00000020" name="DIS"/>
          <bitfield caption="DMA Done Interrupt Enable" mask="0x00000100" name="DDONE"/>
          <bitfield caption="DMA List Done Interrupt Enable" mask="0x00000200" name="LDONE"/>
          <bitfield caption="Histogram Completed Interrupt Enable" mask="0x00001000" name="HISDONE"/>
          <bitfield caption="Histogram Clear Interrupt Enable" mask="0x00002000" name="HISCLR"/>
          <bitfield caption="Write Channel Error Interrupt Enable" mask="0x00010000" name="WERR"/>
          <bitfield caption="Read Channel Error Interrupt Enable" mask="0x00100000" name="RERR"/>
          <bitfield caption="Vertical Front Porch Overflow Interrupt Enable" mask="0x01000000" name="VFPOV"/>
          <bitfield caption="Data Overflow Interrupt Enable" mask="0x02000000" name="DAOV"/>
          <bitfield caption="Vertical Synchronization Timeout Interrupt Enable" mask="0x04000000" name="VDTO"/>
          <bitfield caption="Horizontal Synchronization Timeout Interrupt Enable" mask="0x08000000" name="HDTO"/>
          <bitfield caption="CCIR Decoder Error Interrupt Enable" mask="0x10000000" name="CCIRERR"/>
        </register>
        <register caption="Interrupt Disable Register" name="ISC_INTDIS" offset="0x2C" rw="W" size="4">
          <bitfield caption="Vertical Synchronization Detection Interrupt Disable" mask="0x00000001" name="VD"/>
          <bitfield caption="Horizontal Synchronization Detection Interrupt Disable" mask="0x00000002" name="HD"/>
          <bitfield caption="Software Reset Completed Interrupt Disable" mask="0x00000010" name="SWRST"/>
          <bitfield caption="Disable Completed Interrupt Disable" mask="0x00000020" name="DIS"/>
          <bitfield caption="DMA Done Interrupt Disable" mask="0x00000100" name="DDONE"/>
          <bitfield caption="DMA List Done Interrupt Disable" mask="0x00000200" name="LDONE"/>
          <bitfield caption="Histogram Completed Interrupt Disable" mask="0x00001000" name="HISDONE"/>
          <bitfield caption="Histogram Clear Interrupt Disable" mask="0x00002000" name="HISCLR"/>
          <bitfield caption="Write Channel Error Interrupt Disable" mask="0x00010000" name="WERR"/>
          <bitfield caption="Read Channel Error Interrupt Disable" mask="0x00100000" name="RERR"/>
          <bitfield caption="Vertical Front Porch Overflow Interrupt Disable" mask="0x01000000" name="VFPOV"/>
          <bitfield caption="Data Overflow Interrupt Disable" mask="0x02000000" name="DAOV"/>
          <bitfield caption="Vertical Synchronization Timeout Interrupt Disable" mask="0x04000000" name="VDTO"/>
          <bitfield caption="Horizontal Synchronization Timeout Interrupt Disable" mask="0x08000000" name="HDTO"/>
          <bitfield caption="CCIR Decoder Error Interrupt Disable" mask="0x10000000" name="CCIRERR"/>
        </register>
