Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.3.35/atdf/ATSAMA5D28.atdf
    <module caption="L2 Cache Controller" id="11160" name="L2CC" version="D">
      <register-group name="L2CC">
        <register caption="Cache ID Register" name="L2CC_IDR" offset="0x000" rw="R" size="4">
          <bitfield caption="Cache Controller ID" mask="0xFFFFFFFF" name="ID"/>
        </register>
        <register caption="Cache Type Register" name="L2CC_TYPR" offset="0x004" rw="R" size="4">
          <bitfield caption="Instruction L2 Cache Associativity" mask="0x00000040" name="IL2ASS"/>
          <bitfield caption="Instruction L2 Cache Way Size" mask="0x00000700" name="IL2WSIZE"/>
          <bitfield caption="Data L2 Cache Associativity" mask="0x00040000" name="DL2ASS"/>
          <bitfield caption="Data L2 Cache Way Size" mask="0x00700000" name="DL2WSIZE"/>
        </register>
        <register caption="Control Register" name="L2CC_CR" offset="0x100" rw="RW" size="4">
          <bitfield caption="L2 Cache Enable" mask="0x00000001" name="L2CEN"/>
        </register>
        <register caption="Auxiliary Control Register" name="L2CC_ACR" offset="0x104" rw="RW" size="4">
          <bitfield caption="High Priority for SO and Dev Reads Enable" mask="0x00000400" name="HPSO"/>
          <bitfield caption="Store Buffer Device Limitation Enable" mask="0x00000800" name="SBDLE"/>
          <bitfield caption="Exclusive Cache Configuration" mask="0x00001000" name="EXCC"/>
          <bitfield caption="Shared Attribute Invalidate Enable" mask="0x00002000" name="SAIE"/>
          <bitfield caption="Associativity" mask="0x00010000" name="ASS"/>
          <bitfield caption="Way Size" mask="0x000E0000" name="WAYSIZE" values="L2CC_ACR__WAYSIZE"/>
          <bitfield caption="Event Monitor Bus Enable" mask="0x00100000" name="EMBEN"/>
          <bitfield caption="Parity Enable" mask="0x00200000" name="PEN"/>
          <bitfield caption="Shared Attribute Override Enable" mask="0x00400000" name="SAOEN"/>
          <bitfield caption="Force Write Allocate" mask="0x01800000" name="FWA"/>
          <bitfield caption="Cache Replacement Policy" mask="0x02000000" name="CRPOL"/>
          <bitfield caption="Non-Secure Lockdown Enable" mask="0x04000000" name="NSLEN"/>
          <bitfield caption="Non-Secure Interrupt Access Control" mask="0x08000000" name="NSIAC"/>
          <bitfield caption="Data Prefetch Enable" mask="0x10000000" name="DPEN"/>
          <bitfield caption="Instruction Prefetch Enable" mask="0x20000000" name="IPEN"/>
        </register>
        <register caption="Tag RAM Control Register" name="L2CC_TRCR" offset="0x108" rw="RW" size="4">
          <bitfield caption="Setup Latency" mask="0x00000007" name="TSETLAT"/>
          <bitfield caption="Read Access Latency" mask="0x00000070" name="TRDLAT"/>
          <bitfield caption="Write Access Latency" mask="0x00000700" name="TWRLAT"/>
        </register>
        <register caption="Data RAM Control Register" name="L2CC_DRCR" offset="0x10C" rw="RW" size="4">
          <bitfield caption="Setup Latency" mask="0x00000007" name="DSETLAT"/>
          <bitfield caption="Read Access Latency" mask="0x00000070" name="DRDLAT"/>
          <bitfield caption="Write Access Latency" mask="0x00000700" name="DWRLAT"/>
        </register>
        <register caption="Event Counter Control Register" name="L2CC_ECR" offset="0x200" rw="RW" size="4">
          <bitfield caption="Event Counter Enable" mask="0x00000001" name="EVCEN"/>
          <bitfield caption="Event Counter 0 Reset" mask="0x00000002" name="EVC0RST"/>
          <bitfield caption="Event Counter 1 Reset" mask="0x00000004" name="EVC1RST"/>
        </register>
        <register caption="Event Counter 1 Configuration Register" name="L2CC_ECFGR1" offset="0x204" rw="RW" size="4">
          <bitfield caption="Event Counter Interrupt Generation" mask="0x00000003" name="EIGEN" values="L2CC_ECFGR1__EIGEN"/>
          <bitfield caption="Event Counter Source" mask="0x0000003C" name="ESRC" values="L2CC_ECFGR1__ESRC"/>
        </register>
        <register caption="Event Counter 0 Configuration Register" name="L2CC_ECFGR0" offset="0x208" rw="RW" size="4">
          <bitfield caption="Event Counter Interrupt Generation" mask="0x00000003" name="EIGEN" values="L2CC_ECFGR0__EIGEN"/>
          <bitfield caption="Event Counter Source" mask="0x0000003C" name="ESRC" values="L2CC_ECFGR0__ESRC"/>
        </register>
        <register caption="Event Counter 1 Value Register" name="L2CC_EVR1" offset="0x20C" rw="RW" size="4">
          <bitfield caption="Event Counter Value" mask="0xFFFFFFFF" name="VALUE"/>
        </register>
        <register caption="Event Counter 0 Value Register" name="L2CC_EVR0" offset="0x210" rw="RW" size="4">
          <bitfield caption="Event Counter Value" mask="0xFFFFFFFF" name="VALUE"/>
        </register>
        <register caption="Interrupt Mask Register" name="L2CC_IMR" offset="0x214" rw="RW" size="4">
          <bitfield caption="Event Counter 1/0 Overflow Increment" mask="0x00000001" name="ECNTR"/>
          <bitfield caption="Parity Error on L2 Tag RAM, Read" mask="0x00000002" name="PARRT"/>
          <bitfield caption="Parity Error on L2 Data RAM, Read" mask="0x00000004" name="PARRD"/>
          <bitfield caption="Error on L2 Tag RAM, Write" mask="0x00000008" name="ERRWT"/>
          <bitfield caption="Error on L2 Data RAM, Write" mask="0x00000010" name="ERRWD"/>
          <bitfield caption="Error on L2 Tag RAM, Read" mask="0x00000020" name="ERRRT"/>
          <bitfield caption="Error on L2 Data RAM, Read" mask="0x00000040" name="ERRRD"/>
          <bitfield caption="SLVERR from L3 Memory" mask="0x00000080" name="SLVERR"/>
          <bitfield caption="DECERR from L3 Memory" mask="0x00000100" name="DECERR"/>
        </register>
        <register caption="Masked Interrupt Status Register" name="L2CC_MISR" offset="0x218" rw="R" size="4">
          <bitfield caption="Event Counter 1/0 Overflow Increment" mask="0x00000001" name="ECNTR"/>
          <bitfield caption="Parity Error on L2 Tag RAM, Read" mask="0x00000002" name="PARRT"/>
          <bitfield caption="Parity Error on L2 Data RAM, Read" mask="0x00000004" name="PARRD"/>
          <bitfield caption="Error on L2 Tag RAM, Write" mask="0x00000008" name="ERRWT"/>
          <bitfield caption="Error on L2 Data RAM, Write" mask="0x00000010" name="ERRWD"/>
          <bitfield caption="Error on L2 Tag RAM, Read" mask="0x00000020" name="ERRRT"/>
          <bitfield caption="Error on L2 Data RAM, Read" mask="0x00000040" name="ERRRD"/>
          <bitfield caption="SLVERR from L3 memory" mask="0x00000080" name="SLVERR"/>
          <bitfield caption="DECERR from L3 memory" mask="0x00000100" name="DECERR"/>
        </register>
