Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.3.35/atdf/ATSAMA5D28.atdf
        <register caption="Monitor Information Port 4 Register" name="MPDDRC_MINFO4" offset="0x94" rw="R" size="4">
          <mode name="MAX_WAIT" qualifier="MPDDRC_MCFGR.INFO" value="0"/>
          <mode name="NB_TRANSFERS" qualifier="MPDDRC_MCFGR.INFO" value="1"/>
          <mode name="TOTAL_LATENCY" qualifier="MPDDRC_MCFGR.INFO" value="2"/>
          <bitfield caption="Address High on Port x [x = 0..7]" mask="0x0000FFFF" modes="MAX_WAIT" name="MAX_PORT4_WAITING"/>
          <bitfield caption="Type of Burst on Port x [x = 0..7]" mask="0x00070000" modes="MAX_WAIT" name="BURST" values="MPDDRC_MINFO4__BURST"/>
          <bitfield caption="Transfer Size on Port x [x = 0..7]" mask="0x00700000" modes="MAX_WAIT" name="SIZE" values="MPDDRC_MINFO4__SIZE"/>
          <bitfield caption="Read or Write Access on Port x [x = 0..7]" mask="0x01000000" modes="MAX_WAIT" name="READ_WRITE"/>
          <bitfield caption="Number of Transfers on Port x [x = 0..7]" mask="0xFFFFFFFF" modes="NB_TRANSFERS" name="P4_NB_TRANSFERS"/>
          <bitfield caption="Total Latency on Port x [x = 0..7]" mask="0xFFFFFFFF" modes="TOTAL_LATENCY" name="P4_TOTAL_LATENCY"/>
        </register>
        <register caption="Monitor Information Port 5 Register" name="MPDDRC_MINFO5" offset="0x98" rw="R" size="4">
          <mode name="MAX_WAIT" qualifier="MPDDRC_MCFGR.INFO" value="0"/>
          <mode name="NB_TRANSFERS" qualifier="MPDDRC_MCFGR.INFO" value="1"/>
          <mode name="TOTAL_LATENCY" qualifier="MPDDRC_MCFGR.INFO" value="2"/>
          <bitfield caption="Address High on Port x [x = 0..7]" mask="0x0000FFFF" modes="MAX_WAIT" name="MAX_PORT5_WAITING"/>
          <bitfield caption="Type of Burst on Port x [x = 0..7]" mask="0x00070000" modes="MAX_WAIT" name="BURST" values="MPDDRC_MINFO5__BURST"/>
          <bitfield caption="Transfer Size on Port x [x = 0..7]" mask="0x00700000" modes="MAX_WAIT" name="SIZE" values="MPDDRC_MINFO5__SIZE"/>
          <bitfield caption="Read or Write Access on Port x [x = 0..7]" mask="0x01000000" modes="MAX_WAIT" name="READ_WRITE"/>
          <bitfield caption="Number of Transfers on Port x [x = 0..7]" mask="0xFFFFFFFF" modes="NB_TRANSFERS" name="P5_NB_TRANSFERS"/>
          <bitfield caption="Total Latency on Port x [x = 0..7]" mask="0xFFFFFFFF" modes="TOTAL_LATENCY" name="P5_TOTAL_LATENCY"/>
        </register>
        <register caption="Monitor Information Port 6 Register" name="MPDDRC_MINFO6" offset="0x9C" rw="R" size="4">
          <mode name="MAX_WAIT" qualifier="MPDDRC_MCFGR.INFO" value="0"/>
          <mode name="NB_TRANSFERS" qualifier="MPDDRC_MCFGR.INFO" value="1"/>
          <mode name="TOTAL_LATENCY" qualifier="MPDDRC_MCFGR.INFO" value="2"/>
          <bitfield caption="Address High on Port x [x = 0..7]" mask="0x0000FFFF" modes="MAX_WAIT" name="MAX_PORT6_WAITING"/>
          <bitfield caption="Type of Burst on Port x [x = 0..7]" mask="0x00070000" modes="MAX_WAIT" name="BURST" values="MPDDRC_MINFO6__BURST"/>
          <bitfield caption="Transfer Size on Port x [x = 0..7]" mask="0x00700000" modes="MAX_WAIT" name="SIZE" values="MPDDRC_MINFO6__SIZE"/>
          <bitfield caption="Read or Write Access on Port x [x = 0..7]" mask="0x01000000" modes="MAX_WAIT" name="READ_WRITE"/>
          <bitfield caption="Number of Transfers on Port x [x = 0..7]" mask="0xFFFFFFFF" modes="NB_TRANSFERS" name="P6_NB_TRANSFERS"/>
          <bitfield caption="Total Latency on Port x [x = 0..7]" mask="0xFFFFFFFF" modes="TOTAL_LATENCY" name="P6_TOTAL_LATENCY"/>
        </register>
        <register caption="Monitor Information Port 7 Register" name="MPDDRC_MINFO7" offset="0xA0" rw="R" size="4">
          <mode name="MAX_WAIT" qualifier="MPDDRC_MCFGR.INFO" value="0"/>
          <mode name="NB_TRANSFERS" qualifier="MPDDRC_MCFGR.INFO" value="1"/>
          <mode name="TOTAL_LATENCY" qualifier="MPDDRC_MCFGR.INFO" value="2"/>
          <bitfield caption="Address High on Port x [x = 0..7]" mask="0x0000FFFF" modes="MAX_WAIT" name="MAX_PORT7_WAITING"/>
          <bitfield caption="Type of Burst on Port x [x = 0..7]" mask="0x00070000" modes="MAX_WAIT" name="BURST" values="MPDDRC_MINFO7__BURST"/>
          <bitfield caption="Transfer Size on Port x [x = 0..7]" mask="0x00700000" modes="MAX_WAIT" name="SIZE" values="MPDDRC_MINFO7__SIZE"/>
          <bitfield caption="Read or Write Access on Port x [x = 0..7]" mask="0x01000000" modes="MAX_WAIT" name="READ_WRITE"/>
          <bitfield caption="Number of Transfers on Port x [x = 0..7]" mask="0xFFFFFFFF" modes="NB_TRANSFERS" name="P7_NB_TRANSFERS"/>
          <bitfield caption="Total Latency on Port x [x = 0..7]" mask="0xFFFFFFFF" modes="TOTAL_LATENCY" name="P7_TOTAL_LATENCY"/>
        </register>
        <register caption="Write Protection Mode Register" name="MPDDRC_WPMR" offset="0xE4" rw="RW" size="4">
          <bitfield caption="Write Protection Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protection Key" mask="0xFFFFFF00" name="WPKEY" values="MPDDRC_WPMR__WPKEY"/>
        </register>
        <register caption="Write Protection Status Register" name="MPDDRC_WPSR" offset="0xE8" rw="R" size="4">
          <bitfield caption="Write Protection Enable" mask="0x00000001" name="WPVS"/>
          <bitfield caption="Write Protection Violation Source" mask="0x00FFFF00" name="WPVSRC"/>
        </register>
      </register-group>
      <value-group caption="MPDDRC Command Mode" name="MPDDRC_MR__MODE">
        <value caption="Normal Mode. Any access to the MPDDRC is decoded normally. To activate this mode, the command must be followed by a write to the DDR-SDRAM." name="NORMAL_CMD" value="0x0"/>
        <value caption="The MPDDRC issues a NOP command when the DDR-SDRAM device is accessed regardless of the cycle. To activate this mode, the command must be followed by a write to the DDR-SDRAM." name="NOP_CMD" value="0x1"/>
        <value caption="The MPDDRC issues the All Banks Precharge command when the DDR-SDRAM device is accessed regardless of the cycle. To activate this mode, the command must be followed by a write to the SDRAM." name="PRCGALL_CMD" value="0x2"/>
        <value caption="The MPDDRC issues a Load Mode Register command when the DDR-SDRAM device is accessed regardless of the cycle. To activate this mode, the command must be followed by a write to the DDR-SDRAM." name="LMR_CMD" value="0x3"/>
        <value caption="The MPDDRC issues an Autorefresh command when the DDR-SDRAM device is accessed regardless of the cycle. Previously, an All Banks Precharge command must be issued. To activate this mode, the command must be followed by a write to the DDR-SDRAM." name="RFSH_CMD" value="0x4"/>
        <value caption="The MPDDRC issues an Extended Load Mode Register command when the SDRAM device is accessed regardless of the cycle. To activate this mode, the command must be followed by a write to the DDR-SDRAM. The write in the DDR-SDRAM must be done in the appropriate bank." name="EXT_LMR_CMD" value="0x5"/>
        <value caption="Deep Power mode: Access to Deep Powerdown modeCalibration command: to calibrate RTT and RON values for the Process Voltage Temperature (PVT) (DDR3-SDRAM device)" name="DEEP_CALIB_MD" value="0x6"/>
        <value caption="The MPDDRC issues an LPDDR2/LPDDR3 Mode Register command when the device is accessed regardless of the cycle. To activate this mode, the Mode Register command must be followed by a write to the low-power DDR2-SDRAM or to the low-power DDR3-SDRAM." name="LPDDR2_LPDDR3_CMD" value="0x7"/>
      </value-group>
      <value-group caption="Device Autoinitialization Status (read-only)" name="MPDDRC_MR__DAI">
        <value caption="DAI complete" name="DAI_COMPLETE" value="0"/>
        <value caption="DAI still in progress" name="DAI_IN_PROGESSS" value="1"/>
      </value-group>
      <value-group caption="Number of Column Bits" name="MPDDRC_CR__NC">
        <value caption="9 bits to define the column number, up to 512 columns, for DDR2-SDRAM/DDR3-SDRAM/LPDDR2-SDRAM/LPDDR3-SDRAM 8 bits to define the column number, up to 256 columns, for LPDDR1-SDRAM" name="DDR9_MDDR8_COL_BITS" value="0x0"/>
        <value caption="10 bits to define the column number, up to 1024 columns, for DDR2-SDRAM/DDR3-SDRAM/LPDDR2-SDRAM/LPDDR3-SDRAM 9 bits to define the column number, up to 512 columns, for LPDDR1-SDRAM" name="DDR10_MDDR9_COL_BITS" value="0x1"/>
        <value caption="11 bits to define the column number, up to 2048 columns, for DDR2-SDRAM/DDR3-SDRAM/LPDDR2-SDRAM/LPDDR3-SDRAM 10 bits to define the column number, up to 1024 columns, for LPDDR1-SDRAM" name="DDR11_MDDR10_COL_BITS" value="0x2"/>
        <value caption="12 bits to define the column number, up to 4096 columns, for DDR2-SDRAM/DDR3-SDRAM/LPDDR2-SDRAM/LPDDR3-SDRAM 11 bits to define the column number, up to 2048 columns, for LPDDR1-SDRAM" name="DDR12_MDDR11_COL_BITS" value="0x3"/>
      </value-group>
      <value-group caption="Number of Row Bits" name="MPDDRC_CR__NR">
        <value caption="11 bits to define the row number, up to 2048 rows" name="_11_ROW_BITS" value="0x0"/>
        <value caption="12 bits to define the row number, up to 4096 rows" name="_12_ROW_BITS" value="0x1"/>
        <value caption="13 bits to define the row number, up to 8192 rows" name="_13_ROW_BITS" value="0x2"/>
        <value caption="14 bits to define the row number, up to 16384 rows" name="_14_ROW_BITS" value="0x3"/>
      </value-group>
      <value-group caption="CAS Latency" name="MPDDRC_CR__CAS">
        <value caption="LPDDR1 CAS Latency 2" name="DDR_CAS2" value="0x2"/>
        <value caption="LPDDR3/DDR2/LPDDR2/LPDDR1 CAS Latency 3" name="DDR_CAS3" value="0x3"/>
        <value caption="DDR3 CAS Latency 5" name="DDR_CAS5" value="0x5"/>
        <value caption="DDR3LPDDR3 CAS Latency 6" name="DDR_CAS6" value="0x6"/>
      </value-group>
      <value-group caption="Reset DLL" name="MPDDRC_CR__DLL">
        <value caption="Disable DLL reset" name="RESET_DISABLED" value="0"/>
        <value caption="Enable DLL reset" name="RESET_ENABLED" value="1"/>
      </value-group>
      <value-group caption="Output Driver Impedance Control (Drive Strength)" name="MPDDRC_CR__DIC_DS">
        <value caption="Normal drive strength (DDR2) - RZQ/6 (40 [NOM], DDR3)" name="DDR2_NORMALSTRENGTH_DDR3_RZQ6" value="0"/>
        <value caption="Weak drive strength (DDR2) - RZQ/7 (34 [NOM], DDR3)" name="DDR2_WEAKSTRENGTH_DDR3_RZQ7" value="1"/>
      </value-group>
      <value-group caption="ZQ Calibration" name="MPDDRC_CR__ZQ">
        <value caption="Calibration command after initialization" name="INIT" value="0x0"/>
        <value caption="Long calibration" name="LONG" value="0x1"/>
        <value caption="Short calibration" name="SHORT" value="0x2"/>
        <value caption="ZQ Reset" name="RESET" value="0x3"/>
      </value-group>
      <value-group caption="Off-chip Driver" name="MPDDRC_CR__OCD">
        <value caption="Exit from OCD Calibration mode and maintain settings" name="DDR2_EXITCALIB" value="0x0"/>
        <value caption="OCD calibration default" name="DDR2_DEFAULT_CALIB" value="0x7"/>
      </value-group>
