Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.3.35/atdf/ATSAMA5D28.atdf
      <value-group caption="Mask Data is Shared" name="MPDDRC_CR__DQMS">
        <value caption="DQM is not shared with another controller" name="NOT_SHARED" value="0"/>
        <value caption="DQM is shared with another controller" name="SHARED" value="1"/>
      </value-group>
      <value-group caption="Enable Read Measure" name="MPDDRC_CR__ENRDM">
        <value caption="DQS/DDR_DATA phase error correction is disabled" name="OFF" value="0"/>
        <value caption="DQS/DDR_DATA phase error correction is enabled" name="ON" value="1"/>
      </value-group>
      <value-group caption="Low-cost Low-power DDR1" name="MPDDRC_CR__LC_LPDDR1">
        <value caption="Any type of memory devices except of low cost, low density Low Power DDR1." name="NOT_2_BANKS" value="0"/>
        <value caption="Low-cost and low-density low-power DDR1. These devices have a density of 32 Mbits and are organized as two internal banks. To use this feature, the user has to define the type of memory and the data bus width (see Section 8.8 &quot;MPDDRC Memory Device Register&quot;).The 16-bit memory device is organized as 2 banks, 9 columns and 11 rows.The 32-bit memory device is organized as 2 banks, 8 columns and 11 rows.It is impossible to use two 16-bit memory devices (2 x 32 Mbits) for creating one 32-bit memory device (64 Mbits). In this case, it is recommended to use one 32-bit memory device which embeds four internal banks." name="_2_BANKS_LPDDR1" value="1"/>
      </value-group>
      <value-group caption="Number of Banks" name="MPDDRC_CR__NB">
        <value caption="4-bank memory devices" name="_4_BANKS" value="0"/>
        <value caption="8 banks. Only possible when using the DDR2-SDRAM and low-power DDR2-SDRAM and DDR3-SDRAM and low-power DDR3-SDRAM devices." name="_8_BANKS" value="1"/>
      </value-group>
      <value-group caption="Not DQS" name="MPDDRC_CR__NDQS">
        <value caption="Not DQS is enabled" name="ENABLED" value="0"/>
        <value caption="Not DQS is disabled" name="DISABLED" value="1"/>
      </value-group>
      <value-group caption="Type of Decoding" name="MPDDRC_CR__DECOD">
        <value caption="Method for address mapping where banks alternate at each last DDR-SDRAM page of the current bank." name="SEQUENTIAL" value="0"/>
        <value caption="Method for address mapping where banks alternate at each DDR-SDRAM end of page of the current bank." name="INTERLEAVED" value="1"/>
      </value-group>
      <value-group caption="Support Unaligned Access" name="MPDDRC_CR__UNAL">
        <value caption="Unaligned access is not supported." name="UNSUPPORTED" value="0"/>
        <value caption="Unaligned access is supported." name="SUPPORTED" value="1"/>
      </value-group>
      <value-group caption="Low-power Command Bit" name="MPDDRC_LPR__LPCB">
        <value caption="Low-power feature is inhibited. No Powerdown, Self-refresh and Deep power modes are issued to the DDR-SDRAM device." name="NOLOWPOWER" value="0x0"/>
        <value caption="The MPDDRC issues a self-refresh command to the DDR-SDRAM device, the clock(s) is/are deactivated and the CKE signal is set low. The DDR-SDRAM device leaves the Self-refresh mode when accessed and reenters it after the access." name="SELFREFRESH" value="0x1"/>
        <value caption="The MPDDRC issues a Powerdown command to the DDR-SDRAM device after each access, the CKE signal is set low. The DDR-SDRAM device leaves the Powerdown mode when accessed and reenters it after the access." name="POWERDOWN" value="0x2"/>
        <value caption="The MPDDRC issues a Deep Powerdown command to the low-power DDR-SDRAM device." name="DEEPPOWERDOWN" value="0x3"/>
      </value-group>
      <value-group caption="Clock Frozen Command Bit" name="MPDDRC_LPR__CLK_FR">
        <value caption="Clock(s) is/are not frozen." name="DISABLED" value="0"/>
        <value caption="Clock(s) is/are frozen." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="LPDDR2 - LPDDR3 Power Off Bit" name="MPDDRC_LPR__LPDDR2_LPDDR3_PWOFF">
        <value caption="No power-off sequence applied to LPDDR2/LPDDR3." name="DISABLED" value="0"/>
        <value caption="A power-off sequence is applied to the LPDDR2/LPDDR3 device. CKE is forced low." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Drive Strength" name="MPDDRC_LPR__DS">
        <value caption="Full drive strength" name="DS_FULL" value="0x0"/>
        <value caption="Half drive strength" name="DS_HALF" value="0x1"/>
        <value caption="Quarter drive strength" name="DS_QUARTER" value="0x2"/>
        <value caption="Octant drive strength" name="DS_OCTANT" value="0x3"/>
      </value-group>
      <value-group caption="Time Between Last Transfer and Low-Power Mode" name="MPDDRC_LPR__TIMEOUT">
        <value caption="SDRAM Low-power mode is activated immediately after the end of the last transfer." name="NONE" value="0x0"/>
        <value caption="SDRAM Low-power mode is activated 64 clock cycles after the end of the last transfer." name="DELAY_64_CLK" value="0x1"/>
        <value caption="SDRAM Low-power mode is activated 128 clock cycles after the end of the last transfer." name="DELAY_128_CLK" value="0x2"/>
      </value-group>
      <value-group caption="Active Power Down Exit Time" name="MPDDRC_LPR__APDE">
        <value caption="Fast Exit from Power Down. DDR2-SDRAM and DDR3-SDRAM devices only." name="DDR2_FAST_EXIT" value="0"/>
        <value caption="Slow Exit from Power Down. DDR2-SDRAM and DDR3-SDRAM devices only." name="DDR2_SLOW_EXIT" value="1"/>
      </value-group>
      <value-group caption="Update Load Mode Register and Extended Mode Register" name="MPDDRC_LPR__UPD_MR">
        <value caption="Update of Load Mode and Extended Mode registers is disabled." name="NO_UPDATE" value="0x0"/>
        <value caption="MPDDRC shares an external bus. Automatic update is done during a refresh command and a pending read or write access in the SDRAM device." name="UPDATE_SHAREDBUS" value="0x1"/>
        <value caption="MPDDRC does not share an external bus. Automatic update is done before entering Self-refresh mode." name="UPDATE_NOSHAREDBUS" value="0x2"/>
      </value-group>
      <value-group caption="Memory Device" name="MPDDRC_MD__MD">
        <value caption="Low-power DDR1-SDRAM" name="LPDDR_SDRAM" value="0x3"/>
        <value caption="DDR3-SDRAM" name="DDR3_SDRAM" value="0x4"/>
        <value caption="Low-power DDR3-SDRAM" name="LPDDR3_SDRAM" value="0x5"/>
        <value caption="DDR2-SDRAM" name="DDR2_SDRAM" value="0x6"/>
        <value caption="Low-power DDR2-SDRAM" name="LPDDR2_SDRAM" value="0x7"/>
      </value-group>
      <value-group caption="Data Bus Width" name="MPDDRC_MD__DBW">
        <value caption="Data bus width is 32 bits" name="DBW_32_BITS" value="0"/>
        <value caption="Data bus width is 16 bits." name="DBW_16_BITS" value="1"/>
      </value-group>
      <value-group caption="Write Latency (read-only)" name="MPDDRC_MD__WL">
        <value caption="Write Latency Set A" name="WL_SETA" value="0"/>
        <value caption="Write Latency Set B" name="WL_SETB" value="1"/>
      </value-group>
      <value-group caption="Read Latency 3 Option Support (read-only)" name="MPDDRC_MD__RL3">
        <value caption="Read latency of 3 is supported" name="RL3_SUPPORT" value="0"/>
        <value caption="Read latency 0f 3 is not supported" name="RL3_NOT_SUPPORTED" value="1"/>
      </value-group>
