Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.3.35/atdf/ATSAMA5D28.atdf
        <register caption="Bytes Count Register" name="SHA_BCR" offset="0x30" rw="RW" size="4">
          <bitfield caption="Remaining Byte Count Before Auto Padding" mask="0xFFFFFFFF" name="BYTCNT"/>
        </register>
        <register caption="Input Data 0 Register" count="16" name="SHA_IDATAR" offset="0x40" rw="W" size="4">
          <bitfield caption="Input Data" mask="0xFFFFFFFF" name="IDATA"/>
        </register>
        <register caption="Input/Output Data 0 Register" count="16" name="SHA_IODATAR" offset="0x80" rw="RW" size="4">
          <bitfield caption="Input/Output Data" mask="0xFFFFFFFF" name="IODATA"/>
        </register>
      </register-group>
      <value-group caption="Start Mode" name="SHA_MR__SMOD">
        <value caption="Manual mode" name="MANUAL_START" value="0x0"/>
        <value caption="Auto mode" name="AUTO_START" value="0x1"/>
        <value caption="SHA_IDATAR0 access only mode (mandatory when DMA is used)" name="IDATAR0_START" value="0x2"/>
      </value-group>
      <value-group caption="Processing Delay" name="SHA_MR__PROCDLY">
        <value caption="SHA processing runtime is the shortest one" name="SHORTEST" value="0"/>
        <value caption="SHA processing runtime is the longest one (reduces the SHA bandwidth requirement, reduces the system bus overload)" name="LONGEST" value="1"/>
      </value-group>
      <value-group caption="SHA Algorithm" name="SHA_MR__ALGO">
        <value caption="SHA1 algorithm processed" name="SHA1" value="0x0"/>
        <value caption="SHA256 algorithm processed" name="SHA256" value="0x1"/>
        <value caption="SHA384 algorithm processed" name="SHA384" value="0x2"/>
        <value caption="SHA512 algorithm processed" name="SHA512" value="0x3"/>
        <value caption="SHA224 algorithm processed" name="SHA224" value="0x4"/>
        <value caption="HMAC algorithm with SHA1 Hash processed" name="HMAC_SHA1" value="0x8"/>
        <value caption="HMAC algorithm with SHA256 Hash processed" name="HMAC_SHA256" value="0x9"/>
        <value caption="HMAC algorithm with SHA384 Hash processed" name="HMAC_SHA384" value="0xA"/>
        <value caption="HMAC algorithm with SHA512 Hash processed" name="HMAC_SHA512" value="0xB"/>
        <value caption="HMAC algorithm with SHA224 Hash processed" name="HMAC_SHA224" value="0xC"/>
      </value-group>
      <value-group caption="Dual Input Buffer" name="SHA_MR__DUALBUFF">
        <value caption="SHA_IDATARx and SHA_IODATARx cannot be written during processing of previous block." name="INACTIVE" value="0"/>
        <value caption="SHA_IDATARx and SHA_IODATARx can be written during processing of previous block when SMOD value = 2. It speeds up the overall runtime of large files." name="ACTIVE" value="1"/>
      </value-group>
      <value-group caption="Hash Check" name="SHA_MR__CHECK">
        <value caption="No check is performed" name="NO_CHECK" value="0x0"/>
        <value caption="Check is performed with expected hash stored in internal expected hash value registers." name="CHECK_EHV" value="0x1"/>
        <value caption="Check is performed with expected hash provided after the message." name="CHECK_MESSAGE" value="0x2"/>
      </value-group>
    </module>
    <module caption="Shutdown Controller" id="6122" name="SHDWC" version="S">
      <register-group name="SHDWC">
        <register caption="Shutdown Control Register" name="SHDW_CR" offset="0x00" rw="W" size="4">
          <bitfield caption="Shutdown Command" mask="0x00000001" name="SHDW"/>
          <bitfield caption="Password" mask="0xFF000000" name="KEY" values="SHDW_CR__KEY"/>
        </register>
        <register caption="Shutdown Mode Register" name="SHDW_MR" offset="0x04" rw="RW" size="4">
          <bitfield caption="Real-time Clock Wake-up Enable" mask="0x00020000" name="RTCWKEN"/>
          <bitfield caption="Analog Comparator Controller Wake-up Enable" mask="0x00040000" name="ACCWKEN"/>
          <bitfield caption="Debug Unit Wake-up Enable" mask="0x00080000" name="RXLPWKEN"/>
          <bitfield caption="Wake-up Inputs Debouncer Period" mask="0x07000000" name="WKUPDBC" values="SHDW_MR__WKUPDBC"/>
        </register>
        <register caption="Shutdown Status Register" name="SHDW_SR" offset="0x08" rw="R" size="4">
          <bitfield caption="PIOBU, WKUP Wake-up Status" mask="0x00000001" name="WKUPS" values="SHDW_SR__WKUPS"/>
          <bitfield mask="0x00000020" name="RTCWK"/>
          <bitfield caption="Analog Comparator Controller Wake-up" mask="0x00000040" name="ACCWK"/>
          <bitfield caption="Debug Unit Wake-up" mask="0x00000080" name="RXLPWK"/>
          <bitfield caption="Wake-up 0 Input Status" mask="0x00010000" name="WKUPIS0" values="SHDW_SR__WKUPIS0"/>
          <bitfield caption="Wake-up 1 Input Status" mask="0x00020000" name="WKUPIS1" values="SHDW_SR__WKUPIS1"/>
          <bitfield caption="Wake-up 2 Input Status" mask="0x00040000" name="WKUPIS2" values="SHDW_SR__WKUPIS2"/>
          <bitfield caption="Wake-up 3 Input Status" mask="0x00080000" name="WKUPIS3" values="SHDW_SR__WKUPIS3"/>
          <bitfield caption="Wake-up 4 Input Status" mask="0x00100000" name="WKUPIS4" values="SHDW_SR__WKUPIS4"/>
          <bitfield caption="Wake-up 5 Input Status" mask="0x00200000" name="WKUPIS5" values="SHDW_SR__WKUPIS5"/>
          <bitfield caption="Wake-up 6 Input Status" mask="0x00400000" name="WKUPIS6" values="SHDW_SR__WKUPIS6"/>
          <bitfield caption="Wake-up 7 Input Status" mask="0x00800000" name="WKUPIS7" values="SHDW_SR__WKUPIS7"/>
          <bitfield caption="Wake-up 8 Input Status" mask="0x01000000" name="WKUPIS8" values="SHDW_SR__WKUPIS8"/>
          <bitfield caption="Wake-up 9 Input Status" mask="0x02000000" name="WKUPIS9" values="SHDW_SR__WKUPIS9"/>
        </register>
        <register caption="Shutdown Wake-up Inputs Register" name="SHDW_WUIR" offset="0x0C" rw="RW" size="4">
          <bitfield caption="Wake-up 0 Input Enable" mask="0x00000001" name="WKUPEN0" values="SHDW_WUIR__WKUPEN0"/>
          <bitfield caption="Wake-up 1 Input Enable" mask="0x00000002" name="WKUPEN1" values="SHDW_WUIR__WKUPEN1"/>
          <bitfield caption="Wake-up 2 Input Enable" mask="0x00000004" name="WKUPEN2" values="SHDW_WUIR__WKUPEN2"/>
          <bitfield caption="Wake-up 3 Input Enable" mask="0x00000008" name="WKUPEN3" values="SHDW_WUIR__WKUPEN3"/>
          <bitfield caption="Wake-up 4 Input Enable" mask="0x00000010" name="WKUPEN4" values="SHDW_WUIR__WKUPEN4"/>
          <bitfield caption="Wake-up 5 Input Enable" mask="0x00000020" name="WKUPEN5" values="SHDW_WUIR__WKUPEN5"/>
          <bitfield caption="Wake-up 6 Input Enable" mask="0x00000040" name="WKUPEN6" values="SHDW_WUIR__WKUPEN6"/>
          <bitfield caption="Wake-up 7 Input Enable" mask="0x00000080" name="WKUPEN7" values="SHDW_WUIR__WKUPEN7"/>
          <bitfield caption="Wake-up 8 Input Enable" mask="0x00000100" name="WKUPEN8" values="SHDW_WUIR__WKUPEN8"/>
          <bitfield caption="Wake-up 9 Input Enable" mask="0x00000200" name="WKUPEN9" values="SHDW_WUIR__WKUPEN9"/>
          <bitfield caption="Wake-up 0 Input Type" mask="0x00010000" name="WKUPT0" values="SHDW_WUIR__WKUPT0"/>
          <bitfield caption="Wake-up 1 Input Type" mask="0x00020000" name="WKUPT1" values="SHDW_WUIR__WKUPT1"/>
          <bitfield caption="Wake-up 2 Input Type" mask="0x00040000" name="WKUPT2" values="SHDW_WUIR__WKUPT2"/>
          <bitfield caption="Wake-up 3 Input Type" mask="0x00080000" name="WKUPT3" values="SHDW_WUIR__WKUPT3"/>
          <bitfield caption="Wake-up 4 Input Type" mask="0x00100000" name="WKUPT4" values="SHDW_WUIR__WKUPT4"/>
          <bitfield caption="Wake-up 5 Input Type" mask="0x00200000" name="WKUPT5" values="SHDW_WUIR__WKUPT5"/>
          <bitfield caption="Wake-up 6 Input Type" mask="0x00400000" name="WKUPT6" values="SHDW_WUIR__WKUPT6"/>
          <bitfield caption="Wake-up 7 Input Type" mask="0x00800000" name="WKUPT7" values="SHDW_WUIR__WKUPT7"/>
          <bitfield caption="Wake-up 8 Input Type" mask="0x01000000" name="WKUPT8" values="SHDW_WUIR__WKUPT8"/>
          <bitfield caption="Wake-up 9 Input Type" mask="0x02000000" name="WKUPT9" values="SHDW_WUIR__WKUPT9"/>
        </register>
      </register-group>
      <value-group caption="Password" name="SHDW_CR__KEY">
        <value caption="Writing any other value in this field aborts the write operation." name="PASSWD" value="0xA5"/>
      </value-group>
      <value-group caption="Wake-up Inputs Debouncer Period" name="SHDW_MR__WKUPDBC">
        <value caption="Immediate, no debouncing, detected active at least on one Slow Clock edge" name="IMMEDIATE" value="0x0"/>
        <value caption="PIOBUx shall be in its active state for at least 3 SLCK periods" name="_3_SLCK" value="0x1"/>
        <value caption="PIOBUx shall be in its active state for at least 32 SLCK periods" name="_32_SLCK" value="0x2"/>
        <value caption="PIOBUx shall be in its active state for at least 512 SLCK periods" name="_512_SLCK" value="0x3"/>
        <value caption="PIOBUx shall be in its active state for at least 4,096 SLCK periods" name="_4096_SLCK" value="0x4"/>
        <value caption="PIOBUx shall be in its active state for at least 32,768 SLCK periods" name="_32768_SLCK" value="0x5"/>
      </value-group>
      <value-group caption="PIOBU, WKUP Wake-up Status" name="SHDW_SR__WKUPS">
        <value caption="No wake-up due to the assertion of the PIOBU, WKUP pins has occurred since the last read of SHDW_SR." name="NO" value="0"/>
        <value caption="At least one wake-up due to the assertion of the PIOBU, WKUP pins has occurred since the last read of SHDW_SR." name="PRESENT" value="1"/>
      </value-group>
      <value-group caption="Wake-up 0 Input Status" name="SHDW_SR__WKUPIS0">
        <value caption="The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event." name="DISABLE" value="0"/>
        <value caption="The corresponding wake-up input was active at the time the debouncer triggered a wake-up event." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="Wake-up 1 Input Status" name="SHDW_SR__WKUPIS1">
        <value caption="The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event." name="DISABLE" value="0"/>
        <value caption="The corresponding wake-up input was active at the time the debouncer triggered a wake-up event." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="Wake-up 2 Input Status" name="SHDW_SR__WKUPIS2">
        <value caption="The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event." name="DISABLE" value="0"/>
        <value caption="The corresponding wake-up input was active at the time the debouncer triggered a wake-up event." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="Wake-up 3 Input Status" name="SHDW_SR__WKUPIS3">
        <value caption="The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event." name="DISABLE" value="0"/>
        <value caption="The corresponding wake-up input was active at the time the debouncer triggered a wake-up event." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="Wake-up 4 Input Status" name="SHDW_SR__WKUPIS4">
        <value caption="The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event." name="DISABLE" value="0"/>
        <value caption="The corresponding wake-up input was active at the time the debouncer triggered a wake-up event." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="Wake-up 5 Input Status" name="SHDW_SR__WKUPIS5">
        <value caption="The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event." name="DISABLE" value="0"/>
        <value caption="The corresponding wake-up input was active at the time the debouncer triggered a wake-up event." name="ENABLE" value="1"/>
      </value-group>
