Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.3.35/atdf/ATSAMA5D28.atdf
        <register caption="NFC Interrupt Enable Register" name="HSMC_IER" offset="0x00C" rw="W" size="4">
          <bitfield caption="Ready Busy Rising Edge Detection Interrupt Enable" mask="0x00000010" name="RB_RISE"/>
          <bitfield caption="Ready Busy Falling Edge Detection Interrupt Enable" mask="0x00000020" name="RB_FALL"/>
          <bitfield caption="Transfer Done Interrupt Enable" mask="0x00010000" name="XFRDONE"/>
          <bitfield caption="Command Done Interrupt Enable" mask="0x00020000" name="CMDDONE"/>
          <bitfield caption="Data Timeout Error Interrupt Enable" mask="0x00100000" name="DTOE"/>
          <bitfield caption="Undefined Area Access Interrupt Enable" mask="0x00200000" name="UNDEF"/>
          <bitfield caption="Accessing While Busy Interrupt Enable" mask="0x00400000" name="AWB"/>
          <bitfield caption="NFC Access Size Error Interrupt Enable" mask="0x00800000" name="NFCASE"/>
          <bitfield caption="Ready/Busy Line 0 Interrupt Enable" mask="0x01000000" name="RB_EDGE0"/>
        </register>
        <register caption="NFC Interrupt Disable Register" name="HSMC_IDR" offset="0x010" rw="W" size="4">
          <bitfield caption="Ready Busy Rising Edge Detection Interrupt Disable" mask="0x00000010" name="RB_RISE"/>
          <bitfield caption="Ready Busy Falling Edge Detection Interrupt Disable" mask="0x00000020" name="RB_FALL"/>
          <bitfield caption="Transfer Done Interrupt Disable" mask="0x00010000" name="XFRDONE"/>
          <bitfield caption="Command Done Interrupt Disable" mask="0x00020000" name="CMDDONE"/>
          <bitfield caption="Data Timeout Error Interrupt Disable" mask="0x00100000" name="DTOE"/>
          <bitfield caption="Undefined Area Access Interrupt Disable" mask="0x00200000" name="UNDEF"/>
          <bitfield caption="Accessing While Busy Interrupt Disable" mask="0x00400000" name="AWB"/>
          <bitfield caption="NFC Access Size Error Interrupt Disable" mask="0x00800000" name="NFCASE"/>
          <bitfield caption="Ready/Busy Line 0 Interrupt Disable" mask="0x01000000" name="RB_EDGE0"/>
        </register>
        <register caption="NFC Interrupt Mask Register" name="HSMC_IMR" offset="0x014" rw="R" size="4">
          <bitfield caption="Ready Busy Rising Edge Detection Interrupt Mask" mask="0x00000010" name="RB_RISE"/>
          <bitfield caption="Ready Busy Falling Edge Detection Interrupt Mask" mask="0x00000020" name="RB_FALL"/>
          <bitfield caption="Transfer Done Interrupt Mask" mask="0x00010000" name="XFRDONE"/>
          <bitfield caption="Command Done Interrupt Mask" mask="0x00020000" name="CMDDONE"/>
          <bitfield caption="Data Timeout Error Interrupt Mask" mask="0x00100000" name="DTOE"/>
          <bitfield caption="Undefined Area Access Interrupt Mask5" mask="0x00200000" name="UNDEF"/>
          <bitfield caption="Accessing While Busy Interrupt Mask" mask="0x00400000" name="AWB"/>
          <bitfield caption="NFC Access Size Error Interrupt Mask" mask="0x00800000" name="NFCASE"/>
          <bitfield caption="Ready/Busy Line 0 Interrupt Mask" mask="0x01000000" name="RB_EDGE0"/>
        </register>
        <register caption="NFC Address Cycle Zero Register" name="HSMC_ADDR" offset="0x018" rw="RW" size="4">
          <bitfield caption="NAND Flash Array Address Cycle 0" mask="0x000000FF" name="ADDR_CYCLE0"/>
        </register>
        <register caption="Bank Address Register" name="HSMC_BANK" offset="0x01C" rw="RW" size="4">
          <bitfield caption="Bank Identifier" mask="0x00000001" name="BANK"/>
        </register>
        <register caption="PMECC Configuration Register" name="HSMC_PMECCFG" offset="0x070" rw="RW" size="4">
          <bitfield caption="Error Correcting Capability" mask="0x00000007" name="BCH_ERR" values="HSMC_PMECCFG__BCH_ERR"/>
          <bitfield caption="Sector Size" mask="0x00000010" name="SECTORSZ" values="HSMC_PMECCFG__SECTORSZ"/>
          <bitfield caption="Number of Sectors in the Page" mask="0x00000300" name="PAGESIZE" values="HSMC_PMECCFG__PAGESIZE"/>
          <bitfield caption="NAND Write Access" mask="0x00001000" name="NANDWR"/>
          <bitfield caption="Spare Enable" mask="0x00010000" name="SPAREEN"/>
          <bitfield caption="Automatic Mode Enable" mask="0x00100000" name="AUTO"/>
        </register>
        <register caption="PMECC Spare Area Size Register" name="HSMC_PMECCSAREA" offset="0x074" rw="RW" size="4">
          <bitfield caption="Spare Area Size" mask="0x000001FF" name="SPARESIZE"/>
        </register>
        <register caption="PMECC Start Address Register" name="HSMC_PMECCSADDR" offset="0x078" rw="RW" size="4">
          <bitfield caption="ECC Area Start Address" mask="0x000001FF" name="STARTADDR"/>
        </register>
        <register caption="PMECC End Address Register" name="HSMC_PMECCEADDR" offset="0x07C" rw="RW" size="4">
          <bitfield caption="ECC Area End Address" mask="0x000001FF" name="ENDADDR"/>
        </register>
        <register caption="PMECC Control Register" name="HSMC_PMECCTRL" offset="0x084" rw="W" size="4">
          <bitfield caption="Reset the PMECC Module" mask="0x00000001" name="RST"/>
          <bitfield caption="Start a Data Phase" mask="0x00000002" name="DATA"/>
          <bitfield caption="Start a User Mode Phase" mask="0x00000004" name="USER"/>
          <bitfield caption="PMECC Enable" mask="0x00000010" name="ENABLE"/>
          <bitfield caption="PMECC Enable" mask="0x00000020" name="DISABLE"/>
        </register>
        <register caption="PMECC Status Register" name="HSMC_PMECCSR" offset="0x088" rw="R" size="4">
          <bitfield caption="The kernel of the PMECC is busy" mask="0x00000001" name="BUSY"/>
          <bitfield caption="PMECC Enable bit" mask="0x00000010" name="ENABLE"/>
        </register>
        <register caption="PMECC Interrupt Enable register" name="HSMC_PMECCIER" offset="0x08C" rw="W" size="4">
          <bitfield caption="Error Interrupt Enable" mask="0x00000001" name="ERRIE"/>
        </register>
        <register caption="PMECC Interrupt Disable Register" name="HSMC_PMECCIDR" offset="0x090" rw="W" size="4">
          <bitfield caption="Error Interrupt Disable" mask="0x00000001" name="ERRID"/>
        </register>
        <register caption="PMECC Interrupt Mask Register" name="HSMC_PMECCIMR" offset="0x094" rw="R" size="4">
          <bitfield caption="Error Interrupt Mask" mask="0x00000001" name="ERRIM"/>
        </register>
        <register caption="PMECC Interrupt Status Register" name="HSMC_PMECCISR" offset="0x098" rw="R" size="4">
          <bitfield caption="Error Interrupt Status Register" mask="0x000000FF" name="ERRIS"/>
        </register>
